controllers/PublicaccountController.php

INSERT INTO `we_public_account` (`u_id`, `pa_name`, `pa_type`, `pa_appid`, `pa_appsecret`, `pa_weixin`, `pa_wx_account`) VALUES (1, 'lxc蜈ｬ莨怜十ｷ', '蠕ｮ菫｡蜈ｬ莨怜ｹｳ蜿ｰ', 'wxc7787c3af7a152b9', 'b08741e76a60bfb205df2993410fc233', 'gh_b432e1d66842', 'gh_b432e1d66842')
---
    public function actionAdd()
    {
        $method =  Yii::$app->request->method;
        if($method !="POST"){
            return $this->renderPartial('public_account_add');
        }else{
            $connection=\Yii::$app->db;
            $session = Yii::$app->session;
            $pat_api_link='http://'.$_SERVER['HTTP_HOST']."/ceshi_project/web/wx_sample.php";//获取当前的URL不带参数
            $u_id=$session->get('u_id');
            $arr=$_POST;
            $str=$connection->createCommand()->insert("we_public_account",array(
                "u_id"=>"$u_id",
                "pa_name"=>$arr['pa_name'],
                "pa_type"=>$arr['pa_type'],
                "pa_appid"=>$arr['pa_appid'],
                "pa_appsecret"=>$arr['pa_appsecret'],
                "pa_weixin"=>$arr['pa_weixin'],
                "pa_wx_account"=>$arr['pa_wx_account']
            ))->execute();

INSERT INTO `we_public_account_token` (`pa_id`, `pat_token`, `pat_hash`, `pat_api_link`) VALUES (16, 'WTiJzFgijvVTMDXytJbFxy6ifPnPbI6h', 'rupd2', 'http://127.0.0.1/ceshi_project/web/wx_sample.php')
---
                {
                    $pat_hash.= $string[rand(0,strlen($string)-1)];
                }
                $connection->createCommand()->insert("we_public_account_token",array(
                    "pa_id"=>"$pa_id",
                    "pat_token"=>"$pat_token",
                    "pat_hash"=>"$pat_hash",
                    "pat_api_link"=>"$pat_api_link",
                ))->execute();